Catalogs/упСтилиМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСтилиМаркеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКартинкиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЦвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПривязкиX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПривязкиY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Comment>Ширина изображения в пикселях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Comment>Высота изображения в пикселях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упКартинкиМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упКартинкиМаркеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыбратьИзФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПрибытиеВТочкуМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерНачалоРаботВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерУбытиеСТочкиМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеДиспетчеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеОтДиспетчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерТочкаПропущена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИзменениеСледующейТочкиПоМаршруту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерОтсутствиеЛицензииНаПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КроссДокинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСтилиМаркеров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	ОсновнойЦвет        = упСервисныеФункцииКлиентСервер.HexСтрВЦвет(Объект.ОсновнойЦвет);
	КартинкаИзХранилища = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ХранилищеЗначения");		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементов();
	ОбновитьПредставлениеРазмераКартинки();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОсновнойЦвет = упСервисныеФункцииКлиентСервер.ЦветВHexСтр(ОсновнойЦвет);
	Если ЭтоАдресВременногоХранилища(КартинкаИзХранилища) Тогда 
		ТекущийОбъект.ХранилищеЗначения = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(КартинкаИзХранилища));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЦветПриИзменении(Элемент)
	
	Если ОсновнойЦвет.Вид <> ВидЦвета.Абсолютный Тогда 
		ОсновнойЦвет = ОсновнойЦветПриИзмененииНаСервере(ОсновнойЦвет);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОсновнойЦветПриИзмененииНаСервере(ОсновнойЦвет)
	
	Возврат упСервисныеФункцииКлиентСервер.ПреобразоватьЦветВАбсолютный(ОсновнойЦвет);
	
КонецФункции

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КартинкаПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
	Если Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда 
		КартинкаИзХранилища = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПоУмолчанию")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПоУмолчаниюВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПоУмолчаниюВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(28, 126, 212);
		Объект.ПоложениеПривязкиX = 19;
		Объект.ПоложениеПривязкиY = 39;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерГолубой")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерГолубойВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерГолубойВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(31, 204, 207);
		Объект.ПоложениеПривязкиX = 19;
		Объект.ПоложениеПривязкиY = 39;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЖелтый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЖелтыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЖелтыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(218, 222, 0);
		Объект.ПоложениеПривязкиX = 19;
		Объект.ПоложениеПривязкиY = 39;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЗеленый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЗеленыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЗеленыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(51, 212, 30);
		Объект.ПоложениеПривязкиX = 19;
		Объект.ПоложениеПривязкиY = 39;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерКрасный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерКрасныйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерКрасныйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(209, 34, 31);
		Объект.ПоложениеПривязкиX = 19;
		Объект.ПоложениеПривязкиY = 39;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСиний")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСинийВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСинийВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(31, 31, 209);
		Объект.ПоложениеПривязкиX = 19;
		Объект.ПоложениеПривязкиY = 39;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерФиолетовый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерФиолетовыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерФиолетовыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(219, 9, 195);
		Объект.ПоложениеПривязкиX = 19;
		Объект.ПоложениеПривязкиY = 39;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойБелый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойБелыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойБелыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 255, 255);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойГолубой")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойГолубойВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойГолубойВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(0, 255, 255);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЖелтый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЖелтыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЖелтыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 255, 0);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЗеленый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЗеленыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЗеленыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(0, 255, 0);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойКрасный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойКрасныйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойКрасныйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 0, 0);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойОранжевый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойОранжевыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойОранжевыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 133, 0);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойРозовый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойРозовыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойРозовыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 180, 180);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСерый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСерыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСерыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(192, 192, 192);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСиний")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСинийВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСинийВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(0, 0, 255);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойФиолетовый")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойФиолетовыйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойФиолетовыйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 0, 255);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЧерный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЧерныйВыбранный")  
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЧерныйВыделенный") Тогда 
		ОсновнойЦвет              = Новый Цвет(0, 0, 0);
		Объект.ПоложениеПривязкиX = 5;
		Объект.ПоложениеПривязкиY = 5;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПрибытиеВТочкуМаршрута") Тогда 
		ОсновнойЦвет              = Новый Цвет(250, 180, 163);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерНачалоРаботВТочкеМаршрута") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 218, 180);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерУбытиеСТочкиМаршрута") Тогда 
		ОсновнойЦвет              = Новый Цвет(180, 223, 178);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерТочкаПропущена") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 255, 0);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСообщениеДиспетчеру") 
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерИсходящийЗвонок") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 72, 72);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСообщениеОтДиспетчера") 
		ИЛИ Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерВходящийЗвонок") Тогда 
		ОсновнойЦвет              = Новый Цвет(112, 213, 86);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерИзменениеСледующейТочкиПоМаршруту") Тогда 
		ОсновнойЦвет              = Новый Цвет(5, 156, 10);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;	
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерОтсутствиеЛицензииНаПодключение") Тогда 
		ОсновнойЦвет              = Новый Цвет(255, 64, 37);
		Объект.ПоложениеПривязкиX = 8;
		Объект.ПоложениеПривязкиY = 8;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.Поставщик") Тогда 
		ОсновнойЦвет              = Новый Цвет(97, 65, 30);
		Объект.ПоложениеПривязкиX = 12;
		Объект.ПоложениеПривязкиY = 12;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.КроссДокинг") Тогда 
		ОсновнойЦвет              = Новый Цвет(97, 65, 30);
		Объект.ПоложениеПривязкиX = 12;
		Объект.ПоложениеПривязкиY = 12;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.Склад") Тогда 
		ОсновнойЦвет              = Новый Цвет(97, 65, 30);
		Объект.ПоложениеПривязкиX = 12;
		Объект.ПоложениеПривязкиY = 12;
	ИначеЕсли Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.Магазин") Тогда 
		ОсновнойЦвет              = Новый Цвет(97, 65, 30);
		Объект.ПоложениеПривязкиX = 12;
		Объект.ПоложениеПривязкиY = 12;	
	КонецЕсли;
	
	ОпределитьРазмерИзображения();
	
КонецПроцедуры

&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
	
	ОбновитьПредставлениеРазмераКартинки();	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите картинку'");
	ДиалогОткрытияФайла.Фильтр    = НСтр("ru = 'Картинка'; en = 'Picture'") + "(*.png)|*.png";
	
	ОбратныйВызов = Новый ОписаниеОповещения("ПомещениеФайлаЗавершение", ЭтотОбъект);
	НачатьПомещениеФайлов(ОбратныйВызов,,ДиалогОткрытияФайла,Истина,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла = Объект.Наименование + ".png";
	ДиалогСохраненияФайла.Фильтр    = НСтр("ru = 'Картинка'; en = 'Picture'") + "(*.png)|*.png";
	ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Укажите имя файла'");
	Если ДиалогСохраненияФайла.Выбрать() Тогда
		Если Не ЭтоАдресВременногоХранилища(КартинкаИзХранилища) Тогда 
			СохранитьВФайлНаСервере();
		КонецЕсли;	
		ПолучитьФайл(КартинкаИзХранилища, ДиалогСохраненияФайла.ПолноеИмяФайла,Ложь); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОпределитьРазмерКартинки(Команда)
	
	ОпределитьРазмерИзображения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте	
Процедура ОпределитьРазмерИзображения()

	ИмяВременногоФайла = "";
	Если Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда 
		Если Не ЭтоАдресВременногоХранилища(КартинкаИзХранилища) Тогда
			СохранитьВФайлНаСервере()
		КонецЕсли;
		ИмяВременногоФайла = КартинкаИзХранилища;
	Иначе
		Картинка = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(Объект.Картинка);
		ИмяВременногоФайла = ПоместитьВоВременноеХранилище(ПолучитьДвоичныеДанныеКартинки(Картинка), УникальныйИдентификатор);
	КонецЕсли;
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("ИмяФайла", ИмяВременногоФайла);
	ОткрытьФорму("Справочник.упСтилиМаркеров.Форма.ФормаОпределенияРазмераКартинки", сткПараметры, ЭтаФорма,,,, Новый ОписаниеОповещения("ОпределитьРазмерИзображенияЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеРазмераКартинки()
	
	ПредставлениеРазмераКартинки = НСтр(СтрШаблон("ru = '%1×%2 (в пикселях)'", Окр(Объект.Ширина*?(Объект.Масштаб = 0, 1, Объект.Масштаб/100)),
	                                                                   Окр(Объект.Высота*?(Объект.Масштаб = 0, 1, Объект.Масштаб/100))));
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВФайлНаСервере()

	текОбъект = РеквизитФормыВЗначение("Объект");
	КартинкаИзХранилища = ПоместитьВоВременноеХранилище(текОбъект.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Если Объект.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда 
		Элементы.СтраницыКартинки.ТекущаяСтраница  = Элементы.СтраницаХранилище;
		Элементы.ОсновнойЦвет.ТолькоПросмотр       = Ложь;
		Элементы.ПоложениеПривязкиX.ТолькоПросмотр = Ложь;
		Элементы.ПоложениеПривязкиY.ТолькоПросмотр = Ложь;
	Иначе	
		Элементы.СтраницыКартинки.ТекущаяСтраница  = Элементы.СтраницаКартинка;
		Элементы.ОсновнойЦвет.ТолькоПросмотр       = Истина;
		Элементы.ПоложениеПривязкиX.ТолькоПросмотр = Истина;
		Элементы.ПоложениеПривязкиY.ТолькоПросмотр = Истина;
		
		Картинка = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(Объект.Картинка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура завершения после закрытия формы с размерами картинки.
//
Процедура ОпределитьРазмерИзображенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Ширина = Результат.Ширина;
		Объект.Высота = Результат.Высота;
		ОбновитьПредставлениеРазмераКартинки();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ВыборДоступныхТСЗавершение()

&НаСервере
Функция ПолучитьДвоичныеДанныеКартинки(Картинка)
	Возврат упСервисныеФункцииВызовСервера.ПолучитьДвоичныеДанныеКартинки(Картинка);
КонецФункции

&НаКлиенте
// Процедура завершения помещения файла в хранилище.
//
Процедура ПомещениеФайлаЗавершение(МассивПереданныхФайлов, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(МассивПереданныхФайлов) = ТИП("Массив") Тогда
		Если МассивПереданныхФайлов.Количество() Тогда
			ОписаниеПереданногоФайла = МассивПереданныхФайлов[0];
			КартинкаИзХранилища = ОписаниеПереданногоФайла.Хранение;	
			ОпределитьРазмерИзображения();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
